Repository: anderspippi/regexxer
Catalog: po/*.po
Languages: ro

source: regexxer Search Tool
ro: unealtă de căutare regexxer

source: Search and replace using regular expressions
ro: Caută și înlocuiește utilizând expresii regulare

source: File Patterns
ro: Modele de fișiere

source: List of pre-defined patterns available in the 'Pattern' entry.
ro: Listă de modele predefinite disponibile la intrarea „Model”.

source: Regex Patterns
ro: Modele regex

source: List of last patterns used in the 'Regex' entry.
ro: Lista ultimelor modele folosite la intrarea „Regex”.

source: List of last patterns used in the 'Substitution' entry.
ro: Lista ultimelor modele folosite la intrarea de „Înlocuire”.

source: Text view font
ro: Font pentru vizualizarea textului

source: The font used in the file editor.
ro: Font utilizat în editorul de fișiere.

source: Match color
ro: Culoare de potrivire

source: The background color used to highlight matches of the search expression.
ro: Culoarea de fundal utilizată pentru evidențierea potrivirilor expresiei de căutare.

source: Current-match color
ro: Culoarea de potrivire curentă

source: The background color used to highlight the currently selected match of the search expression.
ro: Culoarea de fundal utilizată pentru evidențierea potrivirii curente a expresiei de căutare selectate.

source: Fallback encoding
ro: Codificare de rezervă

source: Name of the character encoding to use if a file is not readable in either UTF-8 or the codeset specified by the current locale. Try "iconv --list" for a complete list of possible values.
ro: Numele codificării caracterelor de utilizat dacă fișierul nu poate fi citit nici în UTF-8, nici în codificarea specificată de localizarea actuală. Încercați „iconv --list” pentru o listă completă a valorilor posibile.

source: window width
ro: lățimea ferestrei

source: The width of the window.
ro: Lățimea ferestrei.

source: window height
ro: înălțimea ferestrei

source: The height of the window.
ro: Înălțimea ferestrei.

source: window x position
ro: poziția x a ferestrei

source: The X coordinate of the window.
ro: Coordonata X a ferestrei.

source: window y position
ro: poziția y a ferestrei

source: The Y coordinate of the window.
ro: Coordonata Y a ferestrei.

source: window maximization
ro: maximizarea ferestrei

source: Whether the window is maximized.
ro: Dacă fereastra este maximizată sau nu.

source: Show line numbers
ro: Arată numerele liniilor

source: Whether to show the line numbers of the text view.
ro: Dacă să se arate numerele liniilor în vizualizarea text sau nu.

source: Highlight the current line
ro: Evidențiază linia curentă

source: Whether to highlight the current line of the text view.
ro: Dacă să se evidențieze linia curentă în vizualizarea text sau nu.

source: Auto indentation
ro: Indentare automată

source: Whether to enable auto indentation in the text view.
ro: Dacă să se activeze identarea automată în vizualizarea text sau nu.

source: Draw spaces
ro: Desenează spații

source: Which type of space to draw in the text view.
ro: Ce tip de spații să se deseneze în vizualizarea text.

source: Can’t read file:
ro: Nu se poate citi fișierul:

source: File
ro: Fișier

source: Failed to save file “%1”: %2
ro: Salvarea fișierului „%1” a eșuat: %2

source: “%1” seems to be a binary file.
ro: „%1” pare a fi un fișier binar.

source: Find files matching PATTERN
ro: Caută fișiere ce se potrivesc cu MODEL

source: PATTERN
ro: MODEL

source: Do not recurse into subdirectories
ro: Nu intra recursiv prin subdosare

source: Also find hidden files
ro: Caută și fișiere ascunse

source: Find text matching REGEX
ro: Caută text ce se potrivește cu REGEX

source: Find only the first match in a line
ro: Caută doar prima potrivire într-o linie

source: Do case insensitive matching
ro: Fă potrivire cu majuscule nesemnificative

source: Replace matches with STRING
ro: Înlocuiește potrivirile cu ȘIR

source: STRING
ro: ȘIR

source: Print match location to standard output
ro: Tipărește locația potrivirii la ieșirea standard

source: Do not automatically start search
ro: Nu porni căutarea automat

source: [FOLDER]
ro: [DOSAR]

source: Some files haven’t been saved yet. Quit anyway?
ro: Unele fișiere nu au fost încă salvate. Ieșiți oricum?

source: _Cancel
ro: _Anulează

source: _Quit
ro: _Ieșire

source: Some files haven’t been saved yet. Continue anyway?
ro: Unele fișiere nu au fost încă salvate. Ieșiți oricum?

source: The file search pattern is invalid.
ro: Modelul de căutare de fișier nu este valid.

source: The following errors occurred during search:
ro: Următoarele erori au apărut în timpul căutării:

source: The following errors occurred during save:
ro: Următoarele erori au apărut în timpul salvării:

source: translator-credits
ro: Licker Nandor (licker.nandor@gmail.com) Florentina Mușat <florentina [dot] musat [dot] 28 [at] gmail [dot] com>, 2020

source: “%1” is not a valid encoding.
ro: „%1” nu este o codificare validă.

source: Stop
ro: Oprește

source: File:
ro: Fișier:

source: Match:
ro: Potrivire:

source: Cancels the running search
ro: Anulează căutarea curentă

source: _Preferences
ro: _Preferințe

source: _About
ro: _Despre

source: _Save
ro: _Salvează

source: Save _all
ro: S_alvează tot

source: _Undo
ro: An_ulează

source: Cu_t
ro: _Taie

source: _Copy
ro: _Copiază

source: _Paste
ro: Li_pește

source: _Delete
ro: Ș_terge

source: Previous file
ro: Fișierul precedent

source: Back
ro: Înapoi

source: Forward
ro: Înainte

source: Next file
ro: Fișierul următor

source: Replace current
ro: Înlocuiește actualul

source: Replace in this file
ro: Înlocuiește în acest fișier

source: Replace in all files
ro: Înlocuiește în toate fișierele

source: Save all
ro: Salvează tot

source: Fol_der:
ro: _Dosar:

source: Pattern:
ro: Model:

source: recursive
ro: recursiv

source: Recurse into subdirectories
ro: Intră recursiv în subdosare

source: hidden
ro: ascuns

source: Find all files that match the filename pattern
ro: Caută toate fișierele care se potrivesc cu modelul numelui de fișier

source: Find fi_les
ro: Caută fiș_iere

source: Search:
ro: Caută:

source: Replace:
ro: Înlocuiește:

source: Find all possible matches in a line
ro: Caută toate potrivirile posibile într-o linie

source: Find all matches of the regular expression
ro: Caută toate potrivirile expresiei regulate

source: A regular expression in Perl syntax
ro: O expresie regulată în sintaxa Perl

source: The new string to substitute. As in Perl, you can refer to parts of the match using $1, $2, etc. or even $+, $&amp;, $` and $'. The operators \l, \u, \L, \U and \E are supported as well.
ro: Noul șir de înlocuit. În Perl, vă puteți referi la părți ale unei potriviri folosind $1, $2, etc. chiar și $+, $&amp;, $` și $'. Operatorii \l, \u, \L, \U și \E sunt suportați de asemenea.

source: Preview of the substitution
ro: Previzualizarea înlocuirii

source: Preview
ro: Previzualizare

source: _Replace
ro: Î_nlocuiește

source: Replace current match
ro: Înlocuiește potrivirea actuală

source: _This file
ro: Aces_t fișier

source: Replace all matches in the current file
ro: Înlocuiește toate potrivirile din fișierul actual

source: _All files
ro: To_ate fișierele

source: Replace all matches in all files
ro: Înlocuiește toate potrivirile în toate fișierele

source: File backward
ro: Înapoi în fișier

source: Go to the previous matching file
ro: Navighează la fișierul potrivit precedent

source: Backward
ro: Înapoi

source: Go to previous match
ro: Navighează la potrivirea precedentă

source: Go to next match
ro: Navighează la potrivirea următoare

source: File forward
ro: Înainte în fișier

source: Go to the next matching file
ro: Navighează la fișierul potrivit următor

source: Icons only
ro: Doar iconițe

source: Text only
ro: Doar text

source: Icons and text
ro: Iconițe și text

source: Both horizontal
ro: Ambele orizontal

source: Preferences
ro: Preferințe

source: _Text view font:
ro: Font pentru vizualizarea _textului:

source: _Match color:
ro: Culoare potrivi_re:

source: C_urrent match color:
ro: Culoarea potrivirii c_urente:

source: _Look’n’feel
ro: _Aspect și simțire

source: regexxer attempts to read a file in the following encodings before giving up:
ro: regexxer încearcă să citească un fișier în următoarele codificări înainte de a renunța:

source: Fallback _encoding:
ro: Codificare d_e rezervă:

source: The encoding specified by the current locale
ro: Codificarea specificată de localizarea actuală

source: _File access
ro: Acces _fișier
